[
  {
    "intent": "about",
    "patterns": [
      "About SFGC",
      "Sri Satya Sai Group of Colleges was founded with a vision to provide excellent education.",
      "The institution has a strong faculty and excellent infrastructure.",
      "We have state-of-the-art laboratories and learning facilities."
    ],
    "responses": [
      "Sri Satya Sai Group of Colleges was founded with a vision to provide excellent education. The institution has a strong faculty and excellent infrastructure."
    ],
    "context": [
      {
        "url": "https://www.sfgc.ac.in/about",
        "page_type": "about",
        "keywords": ["founded", "vision", "education", "institution", "faculty", "infrastructure"]
      }
    ]
  },
  {
    "intent": "academics",
    "patterns": [
      "Academics - SFGC",
      "Our academic programs are designed to meet international standards.",
      "We offer courses in Engineering, Management, and Science.",
      "Each program is designed to develop critical thinking and practical skills."
    ],
    "responses": [
      "Our academic programs are designed to meet international standards. We offer courses in Engineering, Management, and Science."
    ],
    "context": [
      {
        "url": "https://www.sfgc.ac.in/academics",
        "page_type": "academics",
        "keywords": ["academic", "programs", "international", "standards", "engineering", "management"]
      }
    ]
  },
  {
    "intent": "admissions",
    "patterns": [
      "Admissions - SFGC",
      "Admission process is simple and transparent.",
      "Students can apply online through our portal.",
      "Admission requirements include qualifying entrance exams and academic performance."
    ],
    "responses": [
      "Admission process is simple and transparent. Students can apply online through our portal. Admission requirements include qualifying entrance exams and academic performance."
    ],
    "context": [
      {
        "url": "https://www.sfgc.ac.in/admissions",
        "page_type": "admissions",
        "keywords": ["admission", "process", "transparent", "apply", "online", "portal"]
      }
    ]
  },
  {
    "intent": "contact",
    "patterns": [
      "Contact Us - SFGC",
      "You can reach us at our campus located in the heart of the city.",
      "Phone: +91-XXXXXXXXXX",
      "Email: info@sfgc.ac.in"
    ],
    "responses": [
      "You can reach us at our campus located in the heart of the city. Phone: +91-XXXXXXXXXX Email: info@sfgc.ac.in"
    ],
    "context": [
      {
        "url": "https://www.sfgc.ac.in/contact",
        "page_type": "contact",
        "keywords": ["reach", "campus", "located", "heart", "city"]
      }
    ]
  },
  {
    "intent": "general",
    "patterns": [
      "SFGC - Sri Satya Sai Group of Colleges",
      "Welcome to Sri Satya Sai Group of Colleges.",
      "We are committed to providing quality education and holistic development of students.",
      "Our institution offers various undergraduate and postgraduate courses."
    ],
    "responses": [
      "Welcome to Sri Satya Sai Group of Colleges. We are committed to providing quality education and holistic development of students."
    ],
    "context": [
      {
        "url": "https://www.sfgc.ac.in/",
        "page_type": "home",
        "keywords": ["welcome", "committed", "providing", "quality", "education", "holistic"]
      }
    ]
  }
]
