[
  {
    "url": "https://www.sfgc.ac.in/",
    "title": "Collegewala - Your Education Partner",
    "content": "Welcome to Collegewala. We are committed to providing quality education and holistic development of students.",
    "paragraphs": [
      "Welcome to Collegewala.",
      "We are committed to providing quality education and holistic development of students.",
      "Our institution offers various undergraduate and postgraduate courses."
    ],
    "page_type": "home",
    "links": []
  },
  {
    "url": "https://www.sfgc.ac.in/about",
    "title": "About Collegewala",
    "content": "Collegewala was founded with a vision to provide excellent education. The institution has a strong faculty and excellent infrastructure.",
    "paragraphs": [
      "Collegewala was founded with a vision to provide excellent education.",
      "The institution has a strong faculty and excellent infrastructure.",
      "We have state-of-the-art laboratories and learning facilities."
    ],
    "page_type": "about",
    "links": []
  },
  {
    "url": "https://www.sfgc.ac.in/academics",
    "title": "Academics - Collegewala",
    "content": "Our academic programs are designed to meet international standards. We offer courses in Engineering, Management, and Science.",
    "paragraphs": [
      "Our academic programs are designed to meet international standards.",
      "We offer courses in Engineering, Management, and Science.",
      "Each program is designed to develop critical thinking and practical skills."
    ],
    "page_type": "academics",
    "links": []
  },
  {
    "url": "https://www.sfgc.ac.in/admissions",
    "title": "Admissions - Collegewala",
    "content": "Admission process is simple and transparent. Students can apply online through our portal. Admission requirements include qualifying entrance exams and academic performance.",
    "paragraphs": [
      "Admission process is simple and transparent.",
      "Students can apply online through our portal.",
      "Admission requirements include qualifying entrance exams and academic performance."
    ],
    "page_type": "admissions",
    "links": []
  },
  {
    "url": "https://www.sfgc.ac.in/contact",
    "title": "Contact Us - Collegewala",
    "content": "You can reach us at our campus located in the heart of the city. Phone: +91-XXXXXXXXXX Email: info@collegewala.edu.in",
    "paragraphs": [
      "You can reach us at our campus located in the heart of the city.",
      "Phone: +91-XXXXXXXXXX",
      "Email: info@collegewala.edu.in"
    ],
    "page_type": "contact",
    "links": []
  }
]
