{
    "What courses are offered?": {
      "answer": "Collegewala offers multiple programs: B.Tech in 5 branches (Computer Science, Electronics, Mechanical, Civil, Electrical) for 4 years, MBA for 2 years, MCA for 3 years, and B.Sc in Science streams for 3 years. All programs are highly respected and have 95%+ placement rate. Choose based on your interests and career goals.",
      "category": "Academics",
      "tags": ["courses", "programs", "engineering", "degrees", "bachelor", "master"]
    },
    "How can I apply for admission?": {
      "answer": "Apply in two simple ways: (1) Online: Visit www.collegewala.edu, fill the application form, upload documents, pay fee, submit. Merit list comes in 2 weeks. (2) Offline: Visit our office with documents. After merit list is announced, complete your admission at our office with original documents. We'll help guide you through every step!",
      "category": "Admissions",
      "tags": ["admission", "application", "enrollment", "online", "process", "apply"]
    },
    "Is hostel facility available?": {
      "answer": "Yes! We have comfortable hostels for boys and girls separately. Each room has bed, study table, attached bathroom, WiFi, and 24/7 electricity. We provide nutritious meals, laundry service, and security guards on duty round the clock. Annual hostel fee is Rs. 50,000 to 75,000 depending on room type and amenities.",
      "category": "Facilities",
      "tags": ["hostel", "accommodation", "facilities", "residential", "stay", "dormitory"]
    },
    "What is the placement rate?": {
      "answer": "Collegewala has an excellent 95%+ placement rate! Average salary is Rs. 8 lakhs per year, with highest package reaching Rs. 25 lakhs. Top companies recruiting from us include TCS, Infosys, Wipro, Google, Amazon, Microsoft, and many more. Most students get placed within 3 months of graduation.",
      "category": "Placements",
      "tags": ["placement", "job", "recruitment", "salary", "companies", "career", "employment"]
    },
    "What is the fee structure?": {
      "answer": "Annual fees: B.Tech - Rs. 2.5 lakhs, MBA - Rs. 4 lakhs, MCA - Rs. 3 lakhs, B.Sc - Rs. 1.5 lakhs. Hostel fees are separate: Rs. 50,000-75,000 per year. We offer scholarships for merit, need-based financial aid, SC/ST waivers (100%), and sports scholarships. Fees can be paid in installments - contact finance office for details.",
      "category": "Fees",
      "tags": ["fees", "tuition", "payment", "scholarship", "cost", "charges", "installment"]
    },
    "Are there scholarships available?": {
      "answer": "Absolutely! Collegewala offers various scholarships: (1) Merit scholarships - 10-50% tuition waiver based on entrance exam scores, (2) Need-based financial aid for low-income families, (3) SC/ST scholarships - 100% fee waiver, (4) Minority scholarships, (5) Sports scholarships for talented athletes. Apply before December 31st through Financial Aid Office. These are grants - no need to pay back!",
      "category": "Fees",
      "tags": ["scholarship", "financial aid", "support", "grants", "merit", "need-based", "waiver"]
    },
    "What are the library facilities?": {
      "answer": "Our library has 50,000+ books, 100+ online journals, e-books, and access to databases like JSTOR, IEEE Xplore, and Google Scholar. We have quiet study areas and computer labs for research. Library is open 24/7 during semester. You get a free library card during admission. Books can be borrowed for 15 days.",
      "category": "Facilities",
      "tags": ["library", "resources", "study", "books", "digital", "research", "journals"]
    },
    "Are there sports facilities on campus?": {
      "answer": "Yes! We have state-of-the-art sports facilities including: cricket ground, football field, basketball and badminton courts, tennis court, swimming pool, modern gymnasium, table tennis area, and indoor sports facility. All facilities are free for students. Annual sports meet is held with competitions and prizes. You can join any sports club based on interest.",
      "category": "Facilities",
      "tags": ["sports", "recreation", "activities", "gym", "fitness", "facilities", "swimming"]
    },
    "What are the eligibility criteria for admission?": {
      "answer": "B.Tech: 12th pass with PCM (50% aggregate) + JEE Main score. MBA: Any bachelor's degree with 50% marks + CAT/MAT score. MCA: B.Sc/B.Tech with 50% marks. B.Sc: 12th pass with Science stream. Special relaxations available for SC/ST and differently-abled students. If you have concerns about meeting requirements, contact admissions office - they may consider your profile.",
      "category": "Admissions",
      "tags": ["eligibility", "requirements", "criteria", "entrance", "exam", "qualification", "marks"]
    },
    "Can I pursue internships during my course?": {
      "answer": "Absolutely! Internships are integrated into your curriculum. Summer internships (May-July) and semester internships are available. We partner with Google, Microsoft, Amazon, and many startups. You'll receive monthly stipend (Rs. 10,000-20,000), experience certificate, and this boosts your resume for placement. Final year projects can also be done as internships.",
      "category": "Academics",
      "tags": ["internship", "industry", "experience", "training", "placement", "summer", "paid"]
    },
    "How do I contact the college?": {
      "answer": "Contact us easily: Main Office - +91-80-6751-2345, Admissions - +91-80-6751-2100, Email - admissions@collegewala.edu, Website - www.collegewala.edu, Fax - +91-80-6751-2200. Office hours: 9 AM to 5 PM, Monday-Friday. Emergency line 24/7: +91-98765-43210. You can call, email, or visit in person - we're always happy to help!",
      "category": "Contact",
      "tags": ["contact", "phone", "email", "address", "reach", "call", "communicate"]
    },
    "Where is the college located?": {
      "answer": "Collegewala is in Bangalore, Karnataka. Full address: Jala Hobli Road, Yelahanka New Town, Bangalore 560064. Campus is on beautiful 25 acres of green land. Easy access via public bus and Yelahanka metro station nearby. Parking available on campus. Close to airport and railway station. Perfect location - peaceful for studying yet close to city amenities.",
      "category": "Location",
      "tags": ["location", "address", "directions", "map", "bangalore", "situated", "area", "GPS"]
    },
    "What is the faculty qualification?": {
      "answer": "All our faculty members have PhDs from top universities in India and abroad. Average teaching experience is 10+ years. Teachers actively publish research papers in national and international journals and work on cutting-edge research projects. Student-to-faculty ratio is 12:1, ensuring personalized attention. Teachers are approachable and care about your overall development.",
      "category": "Faculty",
      "tags": ["faculty", "professors", "teachers", "qualification", "experience", "phd", "staff"]
    },
    "Are there extra academic support classes?": {
      "answer": "Yes! We provide free remedial classes for students who need extra help. Classes are held twice a week in the evening with experienced teachers. Small batch size ensures personal attention. All subjects covered - Math, Physics, Chemistry, Programming, etc. You can ask unlimited questions. No extra charges. Talk to your class teacher or visit Academic Support office to enroll.",
      "category": "Academics",
      "tags": ["remedial", "support", "extra classes", "help", "weak", "struggling", "tutoring"]
    },
    "What is the campus size and infrastructure?": {
      "answer": "Our campus spans 25 acres of beautiful green land with modern infrastructure: 12 buildings, 45 classrooms, 30 well-equipped labs, state-of-the-art library, research centers for AI, ML, IoT, and renewable energy. We have sports complex, gymnasium, swimming pool, auditorium, medical center, and student activity center. Wi-Fi covers 100% of campus.",
      "category": "Campus",
      "tags": ["campus", "infrastructure", "buildings", "labs", "facilities", "size", "amenities"]
    },
    "What companies recruit from Collegewala?": {
      "answer": "Top companies recruiting from us: TCS, Infosys, Wipro, Google, Amazon, Microsoft, IBM, Accenture, Cognizant, and many startups. We have 80+ industry partnerships and 25+ international collaborations. Companies visit campus regularly for recruitment drives. Our placement team helps you prepare for interviews and group discussions.",
      "category": "Placements",
      "tags": ["companies", "recruitment", "placement", "jobs", "employers", "corporate", "hiring"]
    },
    "Can I get financial aid if my family has low income?": {
      "answer": "Yes! Collegewala believes education should be accessible to deserving students. We offer need-based financial aid for students from low-income families. Additionally, SC/ST students get 100% fee waiver. We also have merit scholarships and sports scholarships. Apply through Financial Aid Office. Scholarship amounts range from partial waiver to full tuition fee coverage per year.",
      "category": "Fees",
      "tags": ["financial aid", "scholarship", "low income", "support", "waiver", "funds", "grant"]
    },
    "What student activities and clubs are available?": {
      "answer": "Collegewala has vibrant student life with: Tech Club, Entrepreneurship Club, Sports Club, Cultural Club, National Service Scheme (NSS), and many more. Annual events include Tech Fest (technology competition), Cultural Fest (celebration), Hackathons (quarterly), Annual Sports Meet, Industry Seminars, and Tech Symposiums. Participate to develop skills beyond academics!",
      "category": "Campus Life",
      "tags": ["clubs", "activities", "events", "student", "fest", "participation", "culture"]
    },
    "What is the admission timeline and important dates?": {
      "answer": "Admission timeline: Applications open in June, application deadline in July, merit list announced in late July, admission completion in August. Classes start in August/September. Scholarship applications close on December 31st. Entrance exams (JEE, CAT, MAT) have their own schedules - check their official websites. Contact admissions office for exact dates each year as they may vary.",
      "category": "Admissions",
      "tags": ["timeline", "dates", "schedule", "deadlines", "admission", "important", "when"]
    },
    "Is this college recognized and accredited?": {
      "answer": "Absolutely! Collegewala is fully recognized and accredited: (1) NAAC Accredited with A+ Grade - highest rating for academic quality, (2) NBA Accredited for Computer Science, Electronics, and Mechanical Engineering branches, (3) Recognized by Government of India, (4) Member of various educational bodies. Our degrees are valid nationwide and globally recognized. You can confidently pursue your studies here!",
      "category": "Recognition",
      "tags": ["accreditation", "recognition", "NAAC", "NBA", "quality", "certification", "validity"]
    },
    "What are the class hours and daily schedule?": {
      "answer": "Collegewala follows a structured schedule: Morning classes 9:00 AM to 1:00 PM, lunch break 1:00-2:00 PM, afternoon classes 2:00-5:00 PM. Classes run Monday to Friday. Some labs may extend to 6:00 PM. Saturdays have optional seminars and workshops. Sundays are off. During exams, special schedules are announced. Final year students may have flexible timings due to projects and placements. Check the academic calendar for exact dates.",
      "category": "Academics",
      "tags": ["schedule", "class", "timing", "hours", "daily", "timetable", "when"]
    }
  }
